## DS108 Lesson 5 Hands On Helper

### Table of Contents <a class="anchor" id="DS108L5_toc"></a>

* [Table of Contents](#DS108L5_toc)
    * [Page 1 - Part 1](#DS108L5_page_1)
    * [Page 2 - Part 2](#DS108L5_page_2)
    * [Page 3 - Part 3](#DS108L5_page_3)
     * [Page 4 - Extras](#DS108L5_page_4)

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

# Page 1 - Part One<a class="anchor" id="DS108L5_page_1"></a>

[Back to Top](#DS108L5_toc)

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

## Part 1 <br>
#### Run a query that creates a table named Recipes that has the following columns: RecipeID, RecipeName, CountryOrigin. <br>

#### RecipeID is the primary key and auto increments.<br>

```SQL
CREATE TABLE Recipes ( 
RecipeID INTEGER PRIMARY KEY AUTO_INCREMENT, 
RecipeName VARCHAR(50) NOT NULL,
CountryOrigin VARCHAR(50) NOT NULL
);
```

```SQL
INSERT INTO Recipes (RecipeID, RecipeName, CountryOrigin)
VALUE 
(1, "Chicken Cordon Bleu", "France"),
(2, "Creme Brulee", "France"),
(3, "Pasta Puttancesca", "Italy"), 
(4, "Carne Asada", "Mexico"),
(5, "Paella", "Spain");
```

#### INSERT INTO inserts names and data for five recipes. After the INSERT INTO keword is the name of the table, and in parentheses are the columns to be filled. In the next row is the VALUE keyword and the data to insert into each column in each row. Enclose the data for each row in a set of parentheses and inside each set of (), use a comma to separate each column value. The order of the values must match the order of the columns specified after the table name. Each row of data ends with a comma and the last row ends the entire statement with a semicolon.  Text and dates require quotes, numbers including integers and decimals don't require quotes.

### Run a query to see all of the recipes in the database.

```SQL
SELECT * FROM Recipes;
```

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

# Page 2 - Part Two<a class="anchor" id="DS108L5_page_2"></a>

[Back to Top](#DS108L5_toc)

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

### Part 2
#### Run a query that creates a table named Chefs that has the following columns: ChefID, Name, RecipeID as a foreign key and Recipes.

#### ChefID is the primary key and auto increments. <br>
#### RecipeID is a foreign key that references the Recipes table on the RecipeID column.

#### Run a query to see all of the Chefs within the database.

```SQL
CREATE TABLE Chefs ( 
ChefID INTEGER PRIMARY KEY AUTO_INCREMENT,
Name VARCHAR(50) NOT NULL, 
RecipeID INTEGER, FOREIGN KEY (RecipeID) REFERENCES Recipes(RecipeID) 
);

INSERT INTO Chefs (Name, RecipeID) 
VALUE 
("Jacques Pepin", 1), 
("Massimo Bottura", 3),
("Enrique Olvera", 4),
("Jose Andres", 5);

SELECT * FROM Chefs; 


```

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

# Page 3 - Part Three<a class="anchor" id="DS108L5_page_3"></a>

[Back to Top](#DS108L5_toc)

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

### Part 3

#### Run a query that joins the Recipes and Chefs table together using the RecipeID foreign key.

```sql
SELECT * FROM Recipes 
JOIN Chefs USING (RecipeID); 

SELECT * FROM Recipes; 
```

Note that the first table you list is known as the 'left' table - and SQL returns everything for the left table. So make sure you list first the table that's important to have ALL the information in it returned. 

The second table listed (the one right after JOIN) is the right table, and in a regular JOIN query, SQL will return everything from that right table that has something that matches in the left table.



#### Next, create a view named  using the JOIN query created in step 1 adding the following parameters:

- Show only the Chefs' full names and recipe name.
- Rename the column name results using the AS keyword.
- The Authors FullName should display as ChefName.
- The Recipe should display as RecipeName.
- Order the results alphabetically by the authors full name.
- Lastly, run a query to see the view you just created.

```SQL
CREATE VIEW ChefRecipes AS 
SELECT Name AS ChefName, RecipeName as Recipe FROM Recipes 
JOIN Chefs USING (RecipeID) 
ORDER BY Name; 

SELECT * FROM ChefRecipes;
```

Creating an alias with AS  allows you to return a pretty table for your boss or a client, especially if the column names don't normally make any sense (to anybody but you!). You can use the AS  to create temporary pretty table.

After you turn this in, if you don't want to keep the Chefs and Recipes tables, you can drop them, like this.

```sql 
DROP TABLE Chefs;
DROP TABLE Recipes;
```

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

# Page 4 - Extras<a class="anchor" id="DS108L5_page_4"></a>

[Back to Top](#DS108L5_toc)

<hr style="height:10px;border-width:0;color:gray;background-color:darkorchid">

If you want to use comments in your SQL code, there are three ways you can accomplish this. The first is one you're familiar with: a hashtag, or pound sign. It comments out everything to the end of the current line, so you can even use it like this:

```sql
SELECT * FROM users;  # this comment tells you the asterisk means "all" in SQL.
```

The second comment style MySQL supports is a '-- ' to the end of the line. You must have a space after the double dashes.

```sql
SELECT lastname, firstname FROM employees
WHERE reportsTo = 1802  -- gets those who work for Mari.
```

The last way can comment out a whole block of code. Open with slash asterisk, and close with asterisk slash, like this:

```sql
/*
Notice that MySQL does not support nested comments. Comments can be used to document the purpose of an SQL statement or the logic of a code block in a stored procedure. When parsing SQL code, MySQL ignores the comments part. It only executes the SQL part except for executable comment. 
*/


SELECT title, release_year, rating, length
FROM film
WHERE length < 100
ORDER by rating;


/*
Note that with SQL syntax you first line up all the columns from all the tables you want, and the order you list them is the order they will return in. Then specify which database -left, then the right after a JOIN statement, if you have one. Then comes any WHERE statement, where you can further filter your query. Last comes your order, like this:
*/



SELECT * FROM classicmodels
WHERE district_Id = 6435
ORDER BY purchase_date DESC, base_msrp ASC; -- this lists purchases newest to oldest first, then the MSRP from least to greatest. Remember, SQL returns data back in random order, unless you specify how you want it returned. 

```

### We'll finish up with an infographic about datetime formatting.

#### Note that date time format is YYYY-MM-DD - this is the international standard for date formats; using it will help avoid confusion. 
<p style="text-align: left">
  <img  src="../Media/dateFormatComic.jpg" width="400" alt="Video Games">
</p>

Here's the long way to look at three different model years:

```sql

SELECT model
FROM products
WHERE year= 2014
OR year= 2016
OR year = 2019;
```

Here's a much cleaner, shorter way:

```sql

SELECT model
FROM products
WHERE year IN (2014, 2016, 2019);

```

Better yet, say you DIDN'T want those years, but all the other years instead.

```sql

SELECT model
FROM products
WHERE year NOT IN (2014, 2016, 2019);

```